In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['khadija','mala','mona','aniya'],
    "marks":[82,93,55,44],
    "city":['fsd','Lahore','karachi','shakot']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks     city
0  khadija     82      fsd
1     mala     93   Lahore
2     mona     55  karachi
3    aniya     44   shakot

In [5]:
df.to_csv('myFamily.csv')

In [6]:
df.to_csv('myFamily_indexfalse.csv',index=False)

In [7]:
df.head(2)

      name  marks    city
0  khadija     82     fsd
1     mala     93  Lahore

In [8]:
df.tail(2)

    name  marks     city
2   mona     55  karachi
3  aniya     44   shakot

In [9]:
df.describe()

           marks
count   4.000000
mean   68.500000
std    22.840023
min    44.000000
25%    52.250000
50%    68.500000
75%    84.750000
max    93.000000

In [10]:
df.index=['First','second','Third','Fourth']

In [11]:
df

           name  marks     city
First   khadija     82      fsd
second     mala     93   Lahore
Third      mona     55  karachi
Fourth    aniya     44   shakot

In [13]:
ser = pd.Series(np.random.rand(34))

In [14]:
type(ser)

pandas.core.series.Series

In [16]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [18]:
newdf.head()

          0         1         2         3         4
0  0.904227  0.551270  0.889924  0.548091  0.026927
1  0.815863  0.105829  0.750395  0.831174  0.069900
2  0.600287  0.607367  0.400275  0.692875  0.141110
3  0.607863  0.533996  0.728000  0.103981  0.219930
4  0.540420  0.507204  0.740755  0.200824  0.152037

In [19]:
newdf

            0         1         2         3         4
0    0.904227  0.551270  0.889924  0.548091  0.026927
1    0.815863  0.105829  0.750395  0.831174  0.069900
2    0.600287  0.607367  0.400275  0.692875  0.141110
3    0.607863  0.533996  0.728000  0.103981  0.219930
4    0.540420  0.507204  0.740755  0.200824  0.152037
..        ...       ...       ...       ...       ...
329  0.672221  0.121287  0.919356  0.788789  0.044135
330  0.045241  0.826850  0.691397  0.989437  0.012907
331  0.317363  0.222790  0.076254  0.166311  0.250618
332  0.646852  0.030473  0.748567  0.566743  0.362939
333  0.347393  0.888239  0.546826  0.503030  0.690294

[334 rows x 5 columns]

In [20]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.490118    0.501845    0.495210    0.480100    0.480762
std      0.290461    0.282864    0.290831    0.289322    0.294219
min      0.001108    0.001193    0.004159    0.002446    0.001359
25%      0.238285    0.262245    0.249841    0.230414    0.243172
50%      0.484426    0.509364    0.504278    0.469708    0.463984
75%      0.761816    0.755540    0.742902    0.727298    0.745601
max      0.995733    0.999069    0.999793    0.998834    0.997623